import './App.css'

export default function App() {
  return (
    <>
      <h1>Vite + React</h1>
      <h3>Farm products Start</h3>

      <strong>Эту страницу можно представить в виде иерархии следующих компонентов:</strong>

      {/*<PageWrpapeer> // Общая обёртка для всех страниц на сайте часть layout
            <Header> // Шапка сайта, часть layout
              <Logo /> // Логотип сайта, положим в директорию ui, так как может переиспользоваться на сайте
              <Nav> // Навигация сайта, часть layout
                <Button /> // Кнопка для сайта, положим в директорию ui, так как может переиспользоваться на сайте
              </Nav>
            </Header>
            <MainPage> // Компонент с контентом главной страницы, положим в директорию pages
              <About> // Компонент раздела о «Фермерских продуктах», положим в blocks, так как это часть структуры
                <Title /> // Компонент заголовок, положим в директорию ui так как может переиспользоваться на сайте
              </About>
              <FeaturesList> // Компонент раздела преимущества, положим в blocks так как это часть структуры
                <Title /> // Компонент-заголовок, положим в директорию ui, так как может переиспользоваться на сайте
                <FeatureCard1 /> // Компонент карточки преимущества, положим в директорию ui, так как может переиспользоваться на сайте
                <FeatureCard2 />
                ...
                <FeatureCardN />
                <Button /> // Кнопка для сайта, положим в директорию ui, так как может переиспользоваться на сайте
              </FeaturesList>
            </MainPage>
            <Footer> // Подвал сайта, часть layout
              <Logo /> // Логотип сайта, положим в директорию ui, так как может переиспользоваться на сайте
            </Footer>
        </PageWrpapeer> */}

    </>
  )
}


